print("Весели празници")

"""
[Title/Звание]
Rubik's Cube

[Description/Обрисовка]
Игра-платформа, в която можеш да решаваш рубик кубче. 

[Functionalities/Надарености]
- Възможност сам да объркаш куба, или играта да го направи за теб (ако те мързи)
- Очевидно трябва да може да се види от всяка страна, ще се върти около трите оси с помощта на бутони на екрана и клавиши
- Ако разбера алгоритми за решаване, да реши кубчето и да дава подсказки (hints)
- Въртенето на страните или ще става с дърпане с мишката (най вероятно не, защото все още не знам как да го направя)
  или с бутони около куба за всяка страна, в най добрия случай и двете
-- ако е с бутони ляво копче върти по часовника, дясно обратно на часовника (#готина идея, това ще ми е оправданието)

[Milestones/Възлови точки] грубо в следния ред:
- Да науча pygame и как се работи в 3д в pygame
- Куб клас със фукнционалностите му
- Създаване на графичен интерфейс (#place background)
- всички бутони
- Как по дяволите да визуализирам куба?!?!?!
- Въртенето на куба около осите
- Въртене на самите страни на куба
- Евентуално solver


[Estimate in man-hours/Времеоценка в човекочасове]
- Само господ знае в момента колко часа ще ми трябват.
- Ако трябва да кажа число мисля че 4*7*2~48 до 70 часа (все пак трябва и да науча pygame)
- Ако включим solver, нямам идея колко време ще ми трябва

[Usage of technologies/Потребление на технологии]
- Pygame duuh
- Моят велик ум да запомни всичко и да го напише
- за сега друго не знам

[PS/ПП]
- Весели празници, аз пиша това на Бъдни вечер защото си нямам работа (и живот apparently ::pepesad::)
- Ако нещо липсва или не е добре описано, тук съм да го обсъдим

#virus allert
https://3fc4ed44-3fbc-419a-97a1-a29742511391.selcdn.net/coub_storage/coub/simple/cw_timeline_pic/0d799420518/63d52c511416572645d5c/med_1621880191_image.jpg

"""